# Задача 30:  Заполните массив элементами арифметической прогрессии. 
# Её первый элемент, разность и количество элементов нужно ввести с клавиатуры. 
# Формула для получения n-го члена прогрессии: an = a1 + (n-1) * d.
# Каждое число вводится с новой строки.
'''
a1 = int(input(f'Введите первый элемент прогрессии: '))
d = int(input(f'Введите шаг прогрессии: '))
n = int(input(f'Введите количество элементов прогрессии: '))

def arithm_prog(a1, d, n):
    prog_list = list()
    an = 0
    for i in range(1, n + 1):
        an = a1 + (i - 1) * d
        prog_list.append(an)
    return prog_list

print(arithm_prog(a1, d, n))
'''


